In [16]:
import pandas as pd
ratings = pd.read_csv("ratings.csv",sep='::',engine='python',header=None)

In [17]:
len(ratings)

1000209

In [18]:
ratings.head()

   0     1  2          3
0  1  1193  5  978300760
1  1   661  3  978302109
2  1   914  3  978301968
3  1  3408  4  978300275
4  1  2355  5  978824291

In [19]:
ratings_250k = ratings.sample(frac=0.25,replace=False)

In [20]:
len(ratings_250k)

250052

In [21]:
ratings_250k.head()

           0     1  2          3
818849  4918  2393  5  963084417
921709  5568     9  4  959311241
763901  4543  2841  3  966028202
946004  5712  1287  4  958512490
702830  4215  3100  4  965326054

In [22]:
ratings_500k = ratings.sample(frac=0.5,replace=False)

In [23]:
len(ratings_500k)

500104

In [24]:
ratings_750k = ratings.sample(frac=0.75,replace=False)

In [25]:
len(ratings_750k)

750157

In [26]:
ratings_500k.head()

           0     1  2          3
561013  3451   543  5  967241832
860347  5172   111  4  995328048
442578  2726   428  4  973267988
927164  5604   293  5  960001090
103071   684  2858  4  975601758

In [28]:
ratings_750k.head()

           0     1  2          3
579962  3540  2688  4  967573257
573950  3513   118  4  966977929
705977  4227  2024  2  965315874
801211  4801  3704  5  962964377
341046  2010  2034  2  974677528

In [32]:
ratings_250k.to_csv("ratings_250k.csv",header=False,sep=',',index=False)

In [33]:
ratings_500k.to_csv("ratings_500k.csv",header=False,sep=',',index=False)

In [34]:
ratings_750k.to_csv("ratings_750k.csv",header=False,sep=',',index=False)